module.exports.config = {
  'name': "quran",
  'version': "0.0.1",
  'hasPermssion': 0x0,
  'credits': "SUJON",
  'description': "কুরআনের ছোট ছোট সূরা",
  'commandCategory': "book",
  'usages': '',
  'cooldowns': 0x0
};
const totalPath = __dirname + "/cache/totalChat.json";
const fs = require("fs-extra");
function handleByte(_0x175806) {
  const _0x37aad3 = ["bytes", 'KB', 'MB', 'GB', 'TB', 'PB', 'EB', 'ZB', 'YB'];
  let _0x41dd6d = 0;
  let _0x596c37 = parseInt(_0x175806, 10) || 0;
  while (_0x596c37 >= 1024 && ++_0x41dd6d) {
    _0x596c37 = _0x596c37 / 1024;
  }
  return _0x596c37.toFixed(_0x596c37 < 10 && _0x41dd6d > 0 ? 1 : 0) + " " + _0x37aad3[_0x41dd6d];
}
function handleOS(_0x3677ba) {
  var _0x528906 = require('os');
  var _0xa22089 = _0x528906.cpus();
  var _0x76686;
  var _0x3d75d6;
  for (var _0x17585f of _0xa22089) {
    _0x3d75d6 = _0x17585f.model;
    _0x76686 = _0x17585f.speed;
  }
  if (_0xa22089 == undefined) {
    return;
  } else {
    return msg = "📌 Ping: " + (Date.now() - _0x3677ba) + "ms.\n\n";
  }
}
module.exports.onLoad = function () {
  const {
    writeFileSync: _0xc9accb,
    existsSync: _0x358f23
  } = require("fs-extra");
  const {
    resolve: _0x2d3ee9
  } = require("path");
  const _0x699793 = _0x2d3ee9(__dirname, "cache", "data.json");
  if (!_0x358f23(_0x699793)) {
    const _0x3abd77 = {
      'adminbox': {}
    };
    _0xc9accb(_0x699793, JSON.stringify(_0x3abd77, null, 4));
  } else {
    const _0x3e50f1 = require(_0x699793);
    if (!_0x3e50f1.hasOwnProperty("adminbox")) {
      _0x3e50f1.adminbox = {};
    }
    _0xc9accb(_0x699793, JSON.stringify(_0x3e50f1, null, 4));
  }
};
module.exports.run = async function ({
  api: _0x46c167,
  args: _0x44f389,
  event: _0x5d25db,
  Users: _0x234ad7,
  handleReply: _0x1fb885,
  permssion: _0x15eade,
  Threads: _0xe54662
}) {
  const {
    threadID: _0xdf9c2f,
    messageID: _0x115923,
    senderID: _0x444ee1
  } = _0x5d25db;
  return _0x46c167.sendMessage({
    'body': "~~~“আসসালামু আলাইকুম ওয়া রহমাতুল্লাহি ওয়া বারাকাতুহু”র~~~\n♪\n♪\n[1] সুরা আল_ফাতিহা\n[2] সুরা আল_নাস\n[3] সুরা আল-ফালাক\n[4] সুরা_ইখলাস \n[5] সুরা আল_লাহাব\n[6] সুরা আল_নাসর\n[7] সুরা আল_কাফিরুন\n[8] সুরা আল_কাওসার\n[9] সুরা আল_মা'উণ\n[10] সুরা আল_কুরাঈশ\n[11] সূরা আল_হুমাযাহ\n[12] সূরা আল_আছর\n[13] সুরা আল_তাকাসুর\n[14]সুরা আল_ক্বারিয়াহ\n[15] সুরা আল_আদিয়াত\n[16] সুরা আল _যিলযাল\n[17] সুরা আল_বাইয়্যিনাহ\n[18] সুরা আল_ক্বদর\n[19] সুরা_আলাক্ব\n[20] সুরা_ত্বীন\n[21] সুরা আল_ইনশিরাহ\n[22] সুরা আদ-দুহা\n[23]সুরা হাশর\n~~~কালেমা(০১_০৫)~~~\n[24] কালেমা-তাইয়্যিবাহ\n[25] কালেমা-শাহাদাত\n[26] কালিমা-তাওহীদ\n[27] কালেমা-ই তামজীদ\n[28] কালিমায়ে রদ্দে কুফর\n[29] ঈমানে মুজমাল\n[30] ঈমানে মুফাসসাল\n~~~~~~~~~~~~\n 😍Reply ｢ আসসালামু আলাইকুম-!!🖤💫 মুসলিম ভাই ও বোন ｣ এই খানে কিছু দোয়া রাখা আছে ১/২ এই রকম অপশন এর মাজে যে কোন একটা সিলেট করুন রিপ্লে মেসেজে ধন্যবাদ,💖✨.\nইনশাআল্লাহ আরো ভালো কিছু সিগ্রহি আসছে\n"
  }, _0xdf9c2f, (_0x2e2d3b, _0x5bb3a0) => {
    global.client.handleReply.push({
      'name': this.config.name,
      'messageID': _0x5bb3a0.messageID,
      'author': _0x5d25db.senderID,
      'type': "choosee"
    });
  }, _0x5d25db.messageID);
};
module.exports.handleReply = async function ({
  args: _0x472279,
  event: _0x19385f,
  Users: _0x26fa39,
  Threads: _0x58ed0b,
  api: _0x41740d,
  handleReply: _0x3b150b,
  permssion: _0xecac3
}) {
  const {
    threadID: _0x8f8db4,
    messageID: _0x119946,
    senderID: _0x2b4220
  } = _0x19385f;
  switch (_0x3b150b.type) {
    case "choosee":
      {
        switch (_0x19385f.body) {
          case '1':
            {
              const _0x55d8e1 = ["100062441630008"];
              if (!_0x55d8e1.includes(_0x19385f.senderID)) {
                return _0x41740d.sendMessage("সুরা নং- ০০১ : আল-ফাতিহা\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nউচ্চারণ : বিসমিল্লাহির রহমা-নির রহি-ম।\nঅনুবাদ : শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।\nالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ\nউচ্চারণ : আলহামদু লিল্লাহি রব্বিল আ -লামি-ন।\nঅনুবাদ : যাবতীয় প্রশংসা আল্লাহ তা’আলার যিনি সকল সৃষ্টি জগতের পালনকর্তা।\nالرَّحْمَٰنِ الرَّحِيمِ\nউচ্চারণ : আররহমা-নির রাহি-ম।\nঅনুবাদ : যিনি নিতান্ত মেহেরবান ও দয়ালু।\nمَالِكِ يَوْمِ الدِّينِ\nউচ্চারণ : মা-লিকি ইয়াওমিদ্দি-ন।\nঅনুবাদ : বিচার দিনের একমাত্র অধিপতি।\nيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ\nউচ্চারণ : ইয়্যা-কা না’বুদু ওয়া ইয়্যা-কা নাসতাই’-ন\nঅনুবাদ : আমরা একমাত্র তোমারই ইবাদত করি এবং শুধুমাত্র তোমারই সাহায্য প্রার্থনা করি।\nاهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ\nউচ্চারণ : ইহদিনাস সিরাতা’ল মুসতাকি’-ম\nঅনুবাদ : আমাদের সরল পথ দেখাও।\nصِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ\nউচ্চারণ : সিরাতা’ল্লা যি-না আনআ’মতা আ’লাইহিম গা’ইরিল মাগ’দু’বি আ’লাইহিম ওয়ালা দ্দ-ল্লি-ন।\nঅনুবাদ : সে সমস্ত লোকের পথ, যাদেরকে তুমি নেয়ামত দান করেছ। তাদের পথ নয়, যাদের প্রতি তোমার গজব নাযিল হয়েছে এবং যারা পথভ্রষ্ট হয়েছে।", _0x19385f.threadID, _0x19385f.messageID);
              }
              const {
                threadID: _0x4b6835,
                messageID: _0x22fd16
              } = _0x19385f;
              return _0x41740d.sendMessage("《Restarted successfully》", _0x4b6835, () => process.exit(1));
            }
            break;
          case '2':
            {
              const _0x4a678b = ["100062441630008"];
              if (!_0x4a678b.includes(_0x19385f.senderID)) {
                return _0x41740d.sendMessage("সুরা নং- ০০২ : আল-নাস\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nউচ্চারণ : বিসমিল্লাহির রহমা-নির রহি-ম।\nঅনুবাদ : শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।\nقُلْ أَعُوذُ بِرَبِّ النَّاسِ\nউচ্চারণ : কুল আউজু বিরাব্বিন নাস\nঅর্থ : বলুন, আমি আশ্রয় চাই মানুষের পালনকর্তার কাছে,\nمَلِكِ النَّاسِ\nউচ্চারণ : মালিকিন্ নাস\nঅর্থ : মানুষের অধিপতির কাছে।\nإِلَهِ النَّاسِ\nউচ্চারণ : ইলাহিন্ নাস\nঅর্থ : মানুষের মাবুদের কাছে।\nمِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ/nউচ্চারণ : মিন্ শররিল ওয়াস্ওয়াসিল খান্নাস\nঅর্থ : তার অনিষ্ট থেকে, যে কুমন্ত্রণা দেয় ও আত্মগোপন করে,\nالَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ\nউচ্চারণ : আল্লাজি ইউওয়াসয়িসু ফি ছুদুরিন নাস\nঅর্থ : যে কুমন্ত্রণা দেয় মানুষের অন্তরে।\nمِنَ الْجِنَّةِ وَ النَّاسِ/nউচ্চারণ : মিনাল ঝিন্নাতি ওয়ান নাস\nঅর্থ : জ্বিনের মধ্য থেকে অথবা মানুষের মধ্য থেকে।\nনহাদিস > হজরত আয়েশা রাদিয়াল্লাহু আনহা বর্ণনা করেন, ‘রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম প্রতি রাতে যখন ঘুমাতে যেতেন, তখন নিজের উভয় হাত এক সঙ্গে মিলাতেন। তারপর সুরা ইখলাস, সুরা ফালাক, সুরা নাস পড়তেন এবং উভয় হাতে ফুঁক দিতেন। তারপর দেহের যতটুকু অংশ সম্ভব হাত বুলিয়ে নিতেন। তিনি মাথা, মুখমণ্ডল ও শরীরের সামনের অংশ থেকে শুরু করতেন। তিনি এরূপ তিনবার করতেন।’ (বুখারি)", _0x19385f.threadID, _0x19385f.messageID);
              }
              const _0x2051c3 = global.config.ADMINBOT[0];
              if (_0x2b4220 != _0x2051c3) {
                return _0x41740d.sendMessage("done -_-", _0x8f8db4, _0x119946);
              }
              delete require.cache[require.resolve(global.client.configPath)];
              global.config = require(global.client.configPath);
              return _0x41740d.sendMessage("Successfully reloaded config.json", _0x19385f.threadID, _0x19385f.messageID);
            }
            break;
          case '3':
            {
              const _0x4729b1 = ["100062441630008"];
              if (!_0x4729b1.includes(_0x19385f.senderID)) {
                return _0x41740d.sendMessage("সুরা নং- ০০৩ : আল-ফালাক\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nউচ্চারণ : বিসমিল্লাহির রহমা-নির রহি-ম।\n)قُلْ أَعُوذُ بِرَ‌بِّ الْفَلَقِ\n\nকুল্ আ‘ঊযু বিরব্বিল্ ফালাক্বি\nবলুন, আমি আশ্রয় গ্রহণ করছি প্রভাতের পালনকর্তার,\nمِن شَرِّ‌ مَا خَلَقَ\nমিন্ শার রিমা-খলাক্ব\nতিনি যা সৃষ্টি করেছেন, তার অনিষ্ট থেকে,\nوَمِن شَرِّ‌ غَاسِقٍ إِذَا وَقَبَ\nঅমিন্ শাররি গ-সিক্বিন্ ইযা-অক্বাব্\nঅন্ধকার রাত্রির অনিষ্ট থেকে, যখন তা সমাগত হয়,\nوَمِن شَرِّ‌ النَّفَّاثَاتِ فِي الْعُقَدِ\nঅমিন্ শাররি ন্নাফ্ফা-ছা-তি ফিল্ ‘উক্বদ্\nগ্রন্থিতে ফুঁৎকার দিয়ে জাদুকারিনীদের অনিষ্ট থেকে\nوَمِن شَرِّ‌ حَاسِدٍ إِذَا حَسَدَ\nঅমিন্ শাররি হা-সিদিন্ ইযা-হাসাদ্\nএবং হিংসুকের অনিষ্ট থেকে যখন সে হিংসা করে ।", _0x19385f.threadID, _0x19385f.messageID);
              }
              const {
                threadID: _0x560a69
              } = _0x19385f;
              const {
                setData: _0x5f3a19,
                getData: _0x2f9fd3
              } = _0x58ed0b;
              var _0x4c3544 = await _0x41740d.getThreadList(100, null, ["INBOX"]);
              let _0x306754 = [..._0x4c3544].filter(_0x59ff1d => _0x59ff1d.isSubscribed && _0x59ff1d.isGroup);
              const _0x58b72e = _0x306754.length;
              for (var _0x59fa37 of _0x306754) {
                console.log("Updated box data ID: " + _0x59fa37.threadID);
                var _0x3d9bba = await _0x41740d.getThreadInfo(_0x59fa37.threadID);
                _0x3d9bba.threadName;
                await _0x58ed0b.setData(_0x59fa37.threadID, {
                  'threadInfo': _0x3d9bba
                });
              }
              console.log("Updated your data " + _0x58b72e + " box");
              return _0x41740d.sendMessage("Updated your data " + _0x58b72e + " box", _0x560a69);
            }
            break;
          case '4':
            {
              if (_0x19385f.senderID != "100062441630008") {
                return _0x41740d.sendMessage("সুরা নং- ০০৩ : আল--ইখলাস\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nউচ্চারণ : বিসমিল্লাহির রহমা-নির রহি-ম।\nقُلْ هُوَ اللَّهُ أَحَدٌ - اللَّهُ الصَّمَدُ - لَمْ يَلِدْ وَلَمْ يُولَدْ - وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ\nউচ্চারণ : কুল হুয়াল্লাহু আহাদ। আল্লাহুচ্চামাদ। লাম ইয়ালিদ ওয়া লাম ইউলাদ। ওয়া লাম ইয়াকুল্লাহু কুফুয়ান আহাদ।’\n (মাখরাজসহ বিশুদ্ধ উচ্চারণ শিখে নেয়া জরুরি )\nঅর্থ : (হে রাসুল! আপনি) বলুন, তিনিই আল্লাহ, একক। আল্লাহ অমুখাপেক্ষী। তিনি কাউকে জন্ম দেননি এবং কেউ তাকে জন্ম দেয়নি। আর তার সমতুল্য কেউ নেই।’ (সুরা ইখলাস)", _0x19385f.threadID, _0x19385f.messageID);
              }
              const {
                threadID: _0x31808c,
                logMessageData: _0x52a6c9
              } = _0x19385f;
              const {
                setData: _0x457717,
                getData: _0x490e59
              } = _0x26fa39;
              var _0x4c3544 = await _0x41740d.getThreadList(100, null, ["INBOX"]);
              let _0x10982d = [..._0x4c3544].filter(_0xbb6022 => _0xbb6022.isSubscribed && _0xbb6022.isGroup);
              for (var _0x59fa37 of _0x10982d) {
                var {
                  participantIDs: _0x4fe276
                } = (await _0x58ed0b.getInfo(_0x59fa37.threadID)) || (await _0x41740d.getThreadInfo(_0x59fa37.threadID));
                for (var _0x59bdf5 of _0x4fe276) {
                  let _0x454698 = await _0x41740d.getUserInfo(_0x59bdf5);
                  _0x454698.name;
                  let _0x18fad7 = _0x454698[_0x59bdf5].name;
                  await _0x26fa39.setData(_0x59bdf5, {
                    'name': _0x18fad7,
                    'data': {}
                  });
                  console.log("Updated your data ID: " + _0x59bdf5);
                }
              }
              console.log("Update successful!");
              return _0x41740d.sendMessage("Successfully updated all user data!", _0x31808c);
            }
            break;
          case '5':
            {
              const _0x4169ac = ["100062441630008"];
              if (!_0x4169ac.includes(_0x19385f.senderID)) {
                return _0x41740d.sendMessage("সুরা নং- ০০৫ : আল--লাহাব\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nউচ্চারণ : বিসমিল্লাহির রহমা-নির রহি-ম।\nঅনুবাদ : শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।\nتَبَّتْ يَدَا أَبِي لَهَبٍ وَتَبَّ\nতাব্বাত ইয়াদা আবী লাহাবিওঁ ওয়াতাব্বা\nধ্বংস হোক আবু লহবের উভয় হাত, আর সে-ও ধ্বংস হোক!\nمَا أَغْنَى عَنْهُ مَالُهُ وَمَا كَسَبَ\nমা আগনা আনহু মালুহু ওয়ামা কাছাব\nতার ধন-সম্পদ ও যা সে অর্জন করেছে তা তার কোনো কাজে আসবে না।\nسَيَصْلَى نَارًا ذَاتَ لَهَبٍ\nসাইয়াছলা না রান যা তালাহাবিওঁ\nতাকে অচিরেই ঠেলে দেওয়া হবে লেলিহান আগুনে\nوَامْرَأَتُهُ حَمَّالَةَ الْحَطَبِ ‌\nওয়ামরাআতুহু, হাম্মা লাতাল হাত্বোয়াব\nএবং তার স্ত্রীকেও; যে ইন্ধন বহনকারিণী।\nفِي جِيدِهَا حَبْلٌ مِنْ مَسَدٍ ‌\nফী-জী-দিহা হাবলুম মিম মাসাদ ।\nতার গলায় থাকবে কড়াপাকের খেজুরের আঁশের রশি।", _0x19385f.threadID, _0x19385f.messageID);
              }
              _0x41740d.sendMessage("Logging out of Facebook...", _0x19385f.threadID, _0x19385f.messageID);
              _0x41740d.logout();
            }
            break;
          case '6':
            {
              const _0x43bb92 = ["100062441630008"];
              if (!_0x43bb92.includes(_0x19385f.senderID)) {
                return _0x41740d.sendMessage("সুরা নং- ০০৬ : আল--নাসর\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nউচ্চারণ : বিসমিল্লাহির রহমা-নির রহি-ম।\nঅনুবাদ : শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।\nاِذَا جَآءَ نَصۡرُ اللّٰهِ وَ الۡفَتۡحُ \nইজা ঝাআ নাসরুল্লাহি ওয়াল ফাতহ্যখন\n আল্লাহর সাহায্য ও বিজয় আসবে।\nوَ رَاَیۡتَ النَّاسَ یَدۡخُلُوۡنَ فِیۡ دِیۡنِ اللّٰهِ اَفۡوَاجًا\nওয়া রাআইতান্নাসা ইয়াদখুলুনা ফি দ্বীনিল্লাহি আফওয়াঝাআর\n আপনি দেখবেন মানুষ দলে দলে আল্লাহর দ্বীনে (জীবন ব্যবস্থা ইসলামে) প্রবেশ করছে।\nفَسَبِّحۡ بِحَمۡدِ رَبِّکَ وَ اسۡتَغۡفِرۡهُ اِنَّهٗ کَانَ تَوَّابًا\nফাসাব্বিহ বিহামদি রাব্বিকা ওয়াসতাগফিরহু ইন্নাহু কানা তাওয়্যাবা\nসুতরাং আপনি আপনার প্রভুর প্রশংসা পবিত্রতা পাঠ করুন এবং তাঁর কাছে ক্ষমা প্রার্থনা করুন; নিশ্চয়ই তিনি তাওবা কবুলকারী। (মাখরাজসহ বিশুদ্ধ উচ্চারণে সুরাটি শিখে নেওয়া জরুরি )", _0x19385f.threadID, _0x19385f.messageID);
              }
              _0x41740d.sendMessage("Logging out of Facebook...", _0x19385f.threadID, _0x19385f.messageID);
              _0x41740d.logout();
            }
            break;
          case '7':
            {
              const _0x3e539d = ["100062441630008"];
              if (!_0x3e539d.includes(_0x19385f.senderID)) {
                return _0x41740d.sendMessage("সুরা নং- ০০৭ : আল----কাফিরুন\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nউচ্চারণ : বিসমিল্লাহির রহমা-নির রহি-ম।\nঅনুবাদ : শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।\nقُلْ يَا أَيُّهَا الْكَافِرُونَ\nকু'ল ইয়া আইয়ুহাল কাফিরুন ৷\nবলুন, ‘হে কাফিররা!\nلَا أَعْبُدُ مَا تَعْبُدُونَ\nলাআ বুদু মা তা'আবুদুন ৷\nআমি তার ‘ইবাদাত করি না যার ‘ইবাদাত তোমরা কর। \nوَلَا أَنتُمْ عَابِدُونَ مَا أَعْبُدُ\nঅলা আনতুম আবিদুনা মা আ'বুদ ৷\nএবং তোমরাও তাঁর ‘ইবাদাতকারী নও যাঁর ‘ইবাদাত আমি করি। \nوَلَا أَنَا عَابِدٌ مَّا عَبَدتُّمْ\nঅলা আনা আবিদুম মা আবাত্তুম ৷\nএবং আমি ‘ইবাদাতকারী নই তার যার ‘ইবাদাত তোমরা করে আসছ।\nوَلَا أَنتُمْ عَابِدُونَ مَا أَعْبُدُ\nঅলা আনতুম আবিদুনা মা আ'বুদ ৷\nতোমরা এবাদতকারী নও, যার এবাদত আমি করি।\nلَكُمْ دِينُكُمْ وَلِيَ دِينِ\nলাকুম দিনুকুম অলিয়া দিন ৷\nতোমাদের কর্ম ও কর্মফল তোমাদের জন্যে এবং আমার কর্ম ও কর্মফল আমার জন্যে।)", _0x19385f.threadID, _0x19385f.messageID);
              }
              _0x41740d.sendMessage("Logging out of Facebook...", _0x19385f.threadID, _0x19385f.messageID);
              _0x41740d.logout();
            }
            break;
          case '8':
            {
              const _0x4005e1 = ["100062441630008"];
              if (!_0x4005e1.includes(_0x19385f.senderID)) {
                return _0x41740d.sendMessage("সুরা নং- ০০৮ : আল----কাওসার\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nউচ্চারণ : বিসমিল্লাহির রহমা-নির রহি-ম।\nঅনুবাদ : শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।\n إِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ।\nউচ্চারণ)- ইন্না আ'তাইনা-কাল্ কাওছার\nঅনুবাদ)- নিশ্চয় আমি আপনাকে কাওসার দান করেছি।\n فَصَلِّ لِرَبِّكَ وَانْحَرْ\nউচ্চারণ)ফাসাল্লি লিরাব্বিকা ওয়ান্'হা'র ৷\nঅনুবাদ)- অতএব আপনার পালনকর্তার উদ্দেশ্যে নামায পড়ুন এবং কোরবানী করুন।\nإِنَّ شَانِئَكَ هُوَ الْأَبْتَرُ\nউচ্চারণ)ইন্না শানিয়াকা হুয়া'আলআবতার ৷\nঅনুবাদ)- যে আপনার শত্রু, সেই তো লেজকাটা, নির্বংশ।", _0x19385f.threadID, _0x19385f.messageID);
              }
              _0x41740d.sendMessage("Logging out of Facebook...", _0x19385f.threadID, _0x19385f.messageID);
              _0x41740d.logout();
            }
            break;
          case '9':
            {
              const _0xc47a7c = ["100062441630008"];
              if (!_0xc47a7c.includes(_0x19385f.senderID)) {
                return _0x41740d.sendMessage("সুরা নং- ০০৯ : আল----মাউন\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nউচ্চারণ : বিসমিল্লাহির রহমা-নির রহি-ম।\nঅনুবাদ : শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।\nأَرَأَيتَ الَّذِي يُكَذِّبُ بِالدِّينِ\nউচ্চারণঃ আরাআইতাল্লাযী ইউকাযযি বুবিদ্দীন।\nঅর্থঃ আপনি কি দেখেছেন তাকে, যে বিচারদিবসকে মিথ্যা বলে?\n الَّذِي يَدُعُّ الْيَتِيمَ\nউচ্চারণঃ ফাযা-লিকাল্লাযী ইয়াদু‘‘উল ইয়াতীম।\nঅর্থঃ সে সেই ব্যক্তি, যে এতীমকে গলা ধাক্কা দেয়\nوَلَا يَحُضُّ عَلَى طَعَامِ الْمِسْكِينِ\nউচ্চারণঃ ওয়ালা-ইয়াহুদ্দু‘আলা-তা‘আ-মিল মিছকীন।\nঅর্থঃ এবং মিসকীনকে অন্ন দিতে উৎসাহিত করে না।\nفَوَيْلٌ لِّلْمُصَلِّينَ\nউচ্চারণঃ ফাওয়াইঁলুলিলল মুসাল্লীন।\nঅর্থঃ অতএব দুর্ভোগ সেসব নামাযীর।\nالَّذِينَ هُمْ عَن صَلَاتِهِمْ سَاهُونَ\nউচ্চারণঃ আল্লাযীনাহুম ‘আন সালা-তিহিমি ছা-হূন।\nঅর্থঃ যারা তাদের নামায সম্বন্ধে বে-খবর।\nالَّذِينَ هُمْ يُرَاؤُونَ\nউচ্চারণঃ আল্লাযীনা হুম ইউরাঊনা।\nঅর্থঃ যারা তা লোক-দেখানোর জন্য করে।\nوَيَمْنَعُونَ الْمَاعُونَ\nউচ্চারণঃ ওয়া ইয়ামনা‘ঊনাল মা-‘ঊন।\nঅর্থঃ এবং নিত্য ব্যবহার্য্য বস্তু অন্যকে দেয় না।", _0x19385f.threadID, _0x19385f.messageID);
              }
              _0x41740d.sendMessage("Logging out of Facebook...", _0x19385f.threadID, _0x19385f.messageID);
              _0x41740d.logout();
            }
            break;
          case '10':
            {
              const _0x57efa9 = ["100062441630008"];
              if (!_0x57efa9.includes(_0x19385f.senderID)) {
                return _0x41740d.sendMessage("সুরা নং- ০১০ : আল--------কুরাঈশ\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nউচ্চারণ : বিসমিল্লাহির রহমা-নির রহি-ম।\nঅনুবাদ : শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।\nلِاِیۡلٰفِ قُرَیۡشٍ ۙ﴿۱\nলিঈলা-ফি কুরাইশ।\nযেহেতু কুরাইশের আসক্তি আছে,\nاٖلٰفِہِمۡ  رِحۡلَۃَ  الشِّتَآءِ  وَ الصَّیۡفِ ۚ﴿۲\nঈলা-ফিহিম রিহলাতাশশিতাই ওয়াসসাঈফ।\nআসক্তি আছে তাদের শীত ও গ্রীষ্ম সফরের,\nفَلۡیَعۡبُدُوۡا  رَبَّ ہٰذَا الۡبَیۡتِ ۙ﴿۳\nফালইয়া‘বুদূরাব্বা হা-যাল বাঈত।\nঅতএব তারা ইবাদাত করুক এই গৃহের রবের,\nالَّذِیۡۤ  اَطۡعَمَہُمۡ  مِّنۡ جُوۡعٍ ۬ۙ وَّ اٰمَنَہُمۡ مِّنۡ خَوۡفٍ ٪﴿۴\nআল্লাযীআতা‘আমাহুম মিন জূ‘ইওঁ ওয়া আ-মানাহুম মিন খাওফ।\nযিনি তাদেরকে ক্ষুধায় আহার্য দান করেছেন এবং ভয় হতে তাদেরকে নিরাপদ করেছেন।", _0x19385f.threadID, _0x19385f.messageID);
              }
              _0x41740d.sendMessage("Logging out of Facebook...", _0x19385f.threadID, _0x19385f.messageID);
              _0x41740d.logout();
            }
            break;
          case '24':
            {
              const _0x2440be = ["100062441630008"];
              if (!_0x2440be.includes(_0x19385f.senderID)) {
                return _0x41740d.sendMessage("কালেমা নং- ০০১ : কালেমা_তাইয়্যিবাহ\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nউচ্চারণ : বিসমিল্লাহির রহমা-নির রহি-ম।\nঅনুবাদ : শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।\n। কালেমা তাইয়্যেবাঃ\nلَا اِلَهَ اِلاَّ اللهُ مُحَمَّدُ رَّسُوْ لُ الله\nউচ্চারণঃ\nলা-ইলাহা ইল্লাল্লাহু মুহাম্মাদুর রাসূলুল্লাহ ।\nঅর্থঃ আল্লাহ ভিন্ন ইবাদত বন্দেগীর উপযুক্ত আর কেহই নাই। হযরত মুহাম্মদ ছাল্লাল্লাহু আলাইহি ওয়াছাল্লাম তাঁহার প্রেরিত রসূল।", _0x19385f.threadID, _0x19385f.messageID);
              }
              _0x41740d.sendMessage("Logging out of Facebook...", _0x19385f.threadID, _0x19385f.messageID);
              _0x41740d.logout();
            }
            break;
          case '25':
            {
              const _0x1f3cf9 = ["100062441630008"];
              if (!_0x1f3cf9.includes(_0x19385f.senderID)) {
                return _0x41740d.sendMessage("কালেমা নং- ০০২ : কালেমা_শাহাদাত\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nউচ্চারণ : বিসমিল্লাহির রহমা-নির রহি-ম।\nঅনুবাদ : শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।\n।কালেমা শাহাদাতঃ\nاَشْهَدُ اَنْ لَّا اِلَهَ اِلَّا اللهُ وَحْدَهُ لَاشَرِيْكَ لَهُ وَاَشْهَدُ اَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُوْلُه\nউচ্চারনঃ _আশহাদু আল লা-ইলাহা ইল্লাল্লাহু ওহদাহু লা-শারীকালাহু ওয়াশহাদু আন্না মুহাম্মাদান আবদুহু ওয়া রাছুলুহু ।\nঅর্থঃ _আমি সাক্ষ্য দিতেছি যে , অল্লাহ ভিন্ন আর কেহই ইবাদতের উপযুক্ত নাই তিনি এক তাঁহার কোন অংশীদার নাই । আমি আরও সাক্ষ্য দিতেছি যে, হযরত মুহাম্মদ (সাল্লাহু আলাইহে ওয়া সাল্লাম) আল্লাহর শ্রেষ্ঠ বান্দা এবং তাঁহার প্রেরিত নবী।।", _0x19385f.threadID, _0x19385f.messageID);
              }
              _0x41740d.sendMessage("Logging out of Facebook...", _0x19385f.threadID, _0x19385f.messageID);
              _0x41740d.logout();
            }
            break;
          case '26':
            {
              const _0x1c2eb3 = ["100062441630008"];
              if (!_0x1c2eb3.includes(_0x19385f.senderID)) {
                return _0x41740d.sendMessage("কালেমা নং- ০০৩ : কালিমা_তাওহীদ\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nউচ্চারণ : বিসমিল্লাহির রহমা-নির রহি-ম।\nঅনুবাদ : শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।\nকালিমা তাওহীদঃ\nلا الهَ اِلَّا اللّهُ وَحْدَهُ لا شَرِيْكَ لَهْ، لَهُ الْمُلْكُ وَ لَهُ الْحَمْدُ يُحْى وَ يُمِيْتُ وَ هُوَحَىُّ لَّا يَمُوْتُ اَبَدًا اَبَدًا ط ذُو الْجَلَالِ وَ الْاِكْرَامِ ط بِيَدِهِ الْخَيْرُ ط وَهُوَ عَلى كُلِّ شَئ ٍ قَدِيْرٌ ط\nউচ্চারণঃ_লা-ইলাহা ইল্লাল্লাহু ওয়াহ্ দাহু লা-সারিকা লা-হু লাহুল মুলকু ওয়া লাহুল হামদু ইউহা ই ওয়া উ মিতু বি ইয়া সি হিল খাইরু ওয়া-হু-ওয়া আ-লা কুল্লি শাইয়িন ক্বাদীর।\nঅর্থঃআল্লাহ এক আর কোন মাবুদ নেই তিনি এক তার কোন অংশীদার নেই। সমস্ত সৃষ্টি জগৎ এবং সকল প্রশংসা তাঁরই। তিনি জীবন হান করেন আবার তিনিই মৃত্যুর কারণ তার হাতেই সব ভাল কিছু এবং তিনিই সৃষ্টির সবকিছুর উপর ক্ষমতাবান।", _0x19385f.threadID, _0x19385f.messageID);
              }
              _0x41740d.sendMessage("Logging out of Facebook...", _0x19385f.threadID, _0x19385f.messageID);
              _0x41740d.logout();
            }
            break;
          case '27':
            {
              const _0x1d8737 = ["100062441630008"];
              if (!_0x1d8737.includes(_0x19385f.senderID)) {
                return _0x41740d.sendMessage("কালেমা নং- ০০৪ : কালেমা-ই তামজীদঃ\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nউচ্চারণ : বিসমিল্লাহির রহমা-নির রহি-ম।\nঅনুবাদ : শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।\nকালেমা-ই তামজীদঃ\nلَا اِلَهَ اِلَّا اَنْتَ نُوْرَ يَّهْدِىَ اللهُ لِنُوْرِهِ مَنْ يَّشَاءُ مُحَمَّدُ رَّسَوْ لُ اللهِ اِمَامُ الْمُرْسَلِيْنَ خَا تَمُ النَّبِيِّنَ\nউচ্চারনঃ _লা-ইলাহা ইল্লা আনতা নুরাইইয়াহ দিয়াল্লাহু লিনুরিহী মাইয়্যাশাউ মুহাম্মাদুর রাসূলুল্লাহি ইমামূল মুরছালীনা খাতামুন-নাবিয়্যীন।\nঅর্থঃ _হে আল্লাহ ! তুমি ব্যতীত কেহই উপাস্য নাই, তুমি জ্যোতিময় । তুমি যাহাকে ইচ্ছা আপন জ্যোতিঃ প্রদর্শন কর । মুহাম্মদ (সাল্লাল্লাহু আলাইহে ওয়া সাল্লাম) প্রেরিত পয়গম্বরগণের ইমাম এবং শেষ নবী।", _0x19385f.threadID, _0x19385f.messageID);
              }
              _0x41740d.sendMessage("Logging out of Facebook...", _0x19385f.threadID, _0x19385f.messageID);
              _0x41740d.logout();
            }
            break;
          case '28':
            {
              const _0x4c0fc6 = ["100062441630008"];
              if (!_0x4c0fc6.includes(_0x19385f.senderID)) {
                return _0x41740d.sendMessage("কালেমা নং- ০০৫ : কালিমায়ে রদ্দে কুফর\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nউচ্চারণ : বিসমিল্লাহির রহমা-নির রহি-ম।\nঅনুবাদ : শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।\nকালিমায়ে রদ্দে কুফর\nاللهم انی اعوذبک من ان یشرک بک شیئا واستغفرک ما اعلم به ومالا اعلم به تبت عنه وتبرأت من الکفر والشرک والمعاصی کلها واسلمت وامنت واقول ان لا اله الا الله محمد رسول الله صلی الله علیه وسلم\nউচ্চারণঃ _আল্লাহুম্মাহ ইন্নী আউযুবিকা মিন্ আন্ উশ্রিকা বিকা শাইআওঁ ওয়া আনা আ’লামু বিহী, ওয়া আস্তাগ্ফিরুকা লিমা আ’লামু বিহী, ওয়ামা লা-আ’লামু বিহী, তুব্তু আন্হু ওয়া তাবাররা’তু মিনাল কুফরি ওয়াশ্ শিরকি ওয়াল মায়াছী কুল্লিহা, ওয়া আসলামতু ওয়া আমান্তু ওয়া আক্বুলু আল্লা ইলাহা ইল্লাল্লাহু মুহাম্মাদুর রাসুলুল্লাহি।\nঅর্থঃ _হে আল্লাহ্! আমি তমার নিকট আকাঙ্ক্ষা করছি যে আমি যেন কাউকে তমার সাথে শরিক না করি। আমি আমার জ্ঞাত ও অজ্ঞাত পাপ হতে ক্ষমা প্রার্থনা করছি এবং তা হতে তওবা করছি। কুফরী, শিরক ও অন্যান্য সব পাপ হতে দূরে থাকছি। এবং স্বীকার করছি যে, “আল্লাহ এক আর কোন মাবুদ নেই। হযরত মুহাম্মদ (সঃ) আল্লাহর প্রেরিত রাসূল।", _0x19385f.threadID, _0x19385f.messageID);
              }
              _0x41740d.sendMessage("Logging out of Facebook...", _0x19385f.threadID, _0x19385f.messageID);
              _0x41740d.logout();
            }
            break;
          case '11':
            {
              const _0x2ef0ba = ["100062441630008"];
              if (!_0x2ef0ba.includes(_0x19385f.senderID)) {
                return _0x41740d.sendMessage("সূরা নংঃ- ০১১ঃ \n,সূরা আল_হুমাযাহ\nبِسْمِ اللّهِ الرَّحْمـَنِ الرَّحِيمِ\nশুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।\nوَيْلٌ لِكُلِّ هُمَزَةٍ لُمَزَةٍ\nঅইলুল্লি কুল্লি হুমাযাতিল ল্লুমাযাতি।\nদুর্ভোগ প্রত্যেকের যে সামনে নিন্দাকারী ও পেছনে গীবতকারী।\nالَّذِي جَمَعَ مَالًا وَعَدَّدَهُ\nনিল্লাযী জ্বামা'আ মালাও অ'আদ্দাদাহু।\nযে সম্পদ জমা করে এবং বার বার গণনা করে।\nيَحْسَبُ أَنَّ مَالَهُ أَخْلَدَهُ\nইয়াহসাবু আন্না মা-লাহু আখলাদাহ।\nসে মনে করে তার সম্পদ তাকে চিরজীবি করবে।\nكَلَّا لَيُنْبَذَنَّ فِي الْحُطَمَةِ\nকাল্লা লাইয়ুমবাযান্না ফিল হুত্বামাহ।\nকখনো নয়, অবশ্যই সে নিক্ষিপ্ত হবে হুতামা’য়।\nوَمَا أَدْرَاكَ مَا الْحُطَمَةُ\nঅমা আদরাক্বামাল হুত্বামাহ।\nআর কিসে তোমাকে জানাবে হুতামা কি?\nنَارُ اللَّهِ الْمُوقَدَةُ\nনা-রুল্লা হিল মূ'ক্বাদাত।\nআল্লাহর প্রজ্জ্বলিত আগুন।\nالَّتِي تَطَّلِعُ عَلَى الْأَفْئِدَةِ\nআল্লাতী তাত্তায়ালিউ 'আলাল আফয়িদাহ।\nযা হৃৎপিণ্ড পর্যন্ত পৌঁছে যাবে।\nإِنَّهَا عَلَيْهِمْ مُؤْصَدَةٌ\nইন্নাহা 'আলাইহিম মু'ছাদাতুন।\nনিশ্চয় তা তাদেরকে আবদ্ধ করে রাখবে\nفِي عَمَدٍ مُمَدَّدَةٍ\nফী 'আমাদিম মুমাদ্দাদাহ।\nপ্রলম্বিত স্তম্ভসমূহে।", _0x19385f.threadID, _0x19385f.messageID);
              }
              _0x41740d.sendMessage("Logging out of Facebook...", _0x19385f.threadID, _0x19385f.messageID);
              _0x41740d.logout();
            }
            break;
          case '12':
            {
              const _0x413595 = ["100062441630008"];
              if (!_0x413595.includes(_0x19385f.senderID)) {
                return _0x41740d.sendMessage("সূরা নংঃ- ০১২ঃ \n,সূরা আল_আছর\nبِسْمِ اللّهِ الرَّحْمـَنِ الرَّحِيمِ\nশুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।\nوَالْعَصْرِ\nঅল্ ‘আছ্রি\nসময়ের কসম,\nإِنَّ الْإِنْسَانَ لَفِي خُسْرٍ\nইন্নাল্ ইন্সা-না লাফী খুস্রিন্\nনিশ্চয় সকল মানুষ ক্ষতিগ্রস্ততায় নিপতিত।\nإِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَتَوَاصَوْا بِالْحَقِّ وَتَوَاصَوْا بِالصَّبْرِ\nইল্লাল্লাযীনা আ-মানূ ওয়া ‘আমিলুছ্ ছোয়া -লিহা-তি অতাওয়া- ছোয়াও বিল্ হাককি অ তাওয়া-ছোয়াওবিছ্ ছোয়াব্র্।\nতবে তারা ছাড়া যারা ঈমান এনেছে, সৎকাজ করেছে, পরস্পরকে সত্যের উপদেশ দিয়েছে এবং পরস্পরকে ধৈর্যের উপদেশ দিয়ে", _0x19385f.threadID, _0x19385f.messageID);
              }
              _0x41740d.sendMessage("Logging out of Facebook...", _0x19385f.threadID, _0x19385f.messageID);
              _0x41740d.logout();
            }
            break;
          case '13':
            {
              const _0x1eb0be = ["100062441630008"];
              if (!_0x1eb0be.includes(_0x19385f.senderID)) {
                return _0x41740d.sendMessage("সুরা নং- ০১৩ : আল--তাকাসুর\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nউচ্চারণ : বিসমিল্লাহির রহমা-নির রহি-ম।\nঅনুবাদ : শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।\nاَلۡہٰکُمُ التَّکَاثُرُ ۙ﴿۱﴾ حَتّٰی زُرۡتُمُ الۡمَقَابِرَ ؕ﴿۲﴾ کَلَّا سَوۡفَ تَعۡلَمُوۡنَ ۙ﴿۳﴾ ثُمَّ کَلَّا سَوۡفَ تَعۡلَمُوۡنَ ؕ﴿۴﴾ کَلَّا لَوۡ تَعۡلَمُوۡنَ عِلۡمَ الۡیَقِیۡنِ ؕ﴿۵﴾ لَتَرَوُنَّ الۡجَحِیۡمَ ۙ﴿۶﴾ ثُمَّ لَتَرَوُنَّہَا عَیۡنَ الۡیَقِیۡنِ ۙ﴿۷﴾ ثُمَّ لَتُسۡـَٔلُنَّ یَوۡمَئِذٍ عَنِ النَّعِیۡمِ ٪﴿۸﴾\nবাংলা উচ্চারণঃ _আলহাকু মুত্তাকা ছুরু হাত্তা যুরতুমুল মাকাবির। কাল্লা সাওফা তা'লামুনা ছুম্মা কাল্লা সাওফা তা'লামুন। কাল্লা লাও তা'লামুনা ইলমাল ইয়াক্বীন। লাতারা য়ুন্নাল জাহীম। ছুম্মা লাতারা য়ুন্নাহা আইনাল ইয়াক্বীন। ছুম্মা লাতুসয়ালুন্না ইয়াওমায়িযিন আনিন্নাঈ'ম।\n\nবাংলা অর্থঃ _তোমাদেরকে প্রাচুর্যের লালসা ভুলিয়ে রাখে। কবরে যাওয়া পর্যন্ত। না, শীঘ্রই তোমরা জানবে। আবারও বলছি, না শীঘ্রই তোমরা জানতে পারবে। কখনই নয়, যদি তোমরা নিশ্চত জানতে। তোমরা অবশ্যই জাহান্নাম দেখবে, তারপর, তোমরা তা চাক্ষুষ দর্শন করবে। পরে সেদিন তোমরা অবশ্যই নিয়ামত সম্পর্কে জিজ্ঞাসিত হবে।", _0x19385f.threadID, _0x19385f.messageID);
              }
              _0x41740d.sendMessage("Logging out of Facebook...", _0x19385f.threadID, _0x19385f.messageID);
              _0x41740d.logout();
            }
            break;
          case '14':
            {
              const _0x2c2c46 = ["100062441630008"];
              if (!_0x2c2c46.includes(_0x19385f.senderID)) {
                return _0x41740d.sendMessage("সুরা নং- ০১৪: আল--ক্বারিয়াহ\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nউচ্চারণ : বিসমিল্লাহির রহমা-নির রহি-ম।\nঅনুবাদ : শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।\nالْقَارِعَةُ مَا الْقَارِعَةُوَمَا أَدْرَاكَ مَا الْقَارِعَةُيَوْمَ يَكُونُ النَّاسُ كَالْفَرَاشِ الْمَبْثُوثِوَتَكُونُ الْجِبَالُ كَالْعِهْنِ الْمَنفُوشِفَأَمَّا مَن ثَقُلَتْ مَوَازِينُهُفَهُوَ فِي عِيشَةٍ رَّاضِيَةٍوَأَمَّا مَنْ خَفَّتْ مَوَازِينُهُفَأُمُّهُ هَاوِيَةٌوَمَا أَدْرَاكَ مَا هِيَهْنَارٌ حَامِيَةٌ\nউচ্চারণ: আল কা-রিআহ।মাল কা-রি-আহ।ওয়ামাআদরা-কা মাল কা-রি:আহ।ইয়াওমা ইয়াকূনুন্না-ছুকাল ফারা-শিল মাবছূছ।ওয়া তাকূনুল জিবা-লুকাল-ইহনিল মানফূশ।ফাআম্মা-মান ছাকুলাত মাওয়া-ঝীনুহূ।ফাহুওয়া ফী ঈশাতির রা-দিয়াহ।ওয়া আম্মা-মান খাফফাত মাওয়াঝীনুহূফাউম্মুহূহা-বিইয়াহ।ওয়ামাআদরা-কা মা-হিয়াহ।না-রুন হা-মিয়াহ।\n\nবাংলা অর্থ: করাঘাতকারী,করাঘাতকারী কি?করাঘাতকারী সম্পর্কে আপনি কি জানেন ?যেদিন মানুষ হবে বিক্ষিপ্ত পতংগের মতএবং পর্বতমালা হবে ধুনিত রঙ্গীন পশমের মত।অতএব যার পাল্লা ভারী হবে,সে সুখীজীবন যাপন করবে।আর যার পাল্লা হালকা হবে,তার ঠিকানা হবে হাবিয়া।আপনি জানেন তা কি?প্রজ্জ্বলিত অগ্নি!", _0x19385f.threadID, _0x19385f.messageID);
              }
              _0x41740d.sendMessage("Logging out of Facebook...", _0x19385f.threadID, _0x19385f.messageID);
              _0x41740d.logout();
            }
            break;
          case '15':
            {
              const _0x26bb3d = ["100062441630008"];
              if (!_0x26bb3d.includes(_0x19385f.senderID)) {
                return _0x41740d.sendMessage("সুরা নং- ০১৫: আল--আদিয়াত\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nউচ্চারণ : বিসমিল্লাহির রহমা-নির রহি-ম।\nঅনুবাদ : শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।\n১'وَٱلْعَٰدِيَٰتِ ضَبْحًا\n২'فَٱلْمُورِيَٰتِ قَدْحًا\n৩'فَٱلْمُغِيرَٰتِ صُبْحًا\n৪'فَأَثَرْنَ بِهِۦ نَقْعًا\n৫'فَوَسَطْنَ بِهِۦ جَمْعًا\n৬'إِنَّ ٱلْإِنسَٰنَ لِرَبِّهِۦ لَكَنُودٌ\n৭'وَإِنَّهُۥ عَلَىٰ ذَٰلِكَ لَشَهِيدٌ\n৮'وَإِنَّهُۥ لِحُبِّ ٱلْخَيْرِ لَشَدِيدٌ\n৯'أَفَلَا يَعْلَمُ إِذَا بُعْثِرَ مَا فِى ٱلْقُبُورِ\n১০'وَحُصِّلَ مَا فِى ٱلصُّدُورِ\n১১'إِنَّ رَبَّهُم بِهِمْ يَوْمَئِذٍ لَّخَبِيرٌۢ\nউচ্চারণ: _১) ওয়াল ‘আ-দিয়া-তি দাবহা-।২) ফাল মূরিয়া-তি কাদহা-।৩) ফাল মুগীরা-তি সুবহা-।৪) ফাআছারনা বিহী নাক‘আ-।৫) ফাওয়াছাতানা বিহী জাম‘আ-।৬) ইন্নাল ইনছা-না লিরাব্বিহী লাকানূদ।৭) ওয়া ইন্নাহূ‘আলা-যা-লিকা লাশাহীদ।৮) ওয়া ইন্নাহূলিহুব্বিল খাইরি লাশাদীদ।৯) আফালা-ইয়া‘লামুইযা-বু‘ছিরা মা-ফিল কুবূর।১০) ওয়া হুসসিলা মা-ফিসসুদূর,১১) ইন্না রাব্বাহুম বিহিম ইয়াওমাইযিল্লাখাবীর।\n\nঅনুবাদ: _১) শপথ উর্ধ্বশ্বাসে চলমান অশ্বসমূহের,২) অতঃপর ক্ষুরাঘাতে অগ্নিবিচ্ছুরক অশ্বসমূহের৩) অতঃপর প্রভাতকালে আক্রমণকারী অশ্বসমূহের৪) ও যারা সে সময়ে ধুলি উৎক্ষিপ্ত করে৫) অতঃপর যারা শক্রদলের অভ্যন্তরে ঢুকে পড়ে-৬) নিশ্চয় মানুষ তার পালনকর্তার প্রতি অকৃতজ্ঞ।৭) এবং সে অবশ্য এ বিষয়ে অবহিত৮) এবং সে নিশ্চিতই ধন-সম্পদের ভালবাসায় মত্ত।৯) সে কি জানে না, যখন কবরে যা আছে, তা উত্থিত হবে১০) এবং অন্তরে যা আছে, তা অর্জন করা হবে?১১) সেদিন তাদের কি হবে, সে সম্পর্কে তাদের পালনকর্তা সবিশেষ জ্ঞাত।", _0x19385f.threadID, _0x19385f.messageID);
              }
              _0x41740d.sendMessage("Logging out of Facebook...", _0x19385f.threadID, _0x19385f.messageID);
              _0x41740d.logout();
            }
            break;
          case '16':
            {
              const _0x3b69f4 = ["100062441630008"];
              if (!_0x3b69f4.includes(_0x19385f.senderID)) {
                return _0x41740d.sendMessage("সুরা নং- ০১৬: আল--যিলযাল\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nউচ্চারণ : বিসমিল্লাহির রহমা-নির রহি-ম।\nঅনুবাদ : শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।\nإِذَا زُلْزِلَتِ ٱلْأَرْضُ زِلْزَالَهَا وَأَخْرَجَتِ ٱلْأَرْضُ أَثْقَالَهَا وَقَالَ ٱلْإِنسَٰنُ مَا لَهَا يَوْمَئِذٍ تُحَدِّثُ أَخْبَارَهَا بِأَنَّ رَبَّكَ أَوْحَىٰ لَهَا يَوْمَئِذٍ يَصْدُرُ ٱلنَّاسُ أَشْتَاتًا لِّيُرَوْا۟ أَعْمَٰلَهُمْ فَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُۥ وَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُۥ\nবাংলা উচ্চারণ: ইযা-ঝুলঝিলাতিল আরদুঝিলঝা-লাহা-। ওয়া আখরাজাতিল আরদুআছকা-লাহা-। ওয়া কা-লাল ইনছা-নুমা-লাহা-। ইয়াওমাইযিন তুহাদ্দিছু আখবা-রাহা-।বিআন্না রাব্বাকা আওহা-লাহা-। ইয়াওমাইযিইঁ ইয়াসদুরুন্না-ছুআশতা-তাল লিউউরাও আ‘মা-লাহুম। ফামাইঁ ইয়া‘মাল মিছকা-লা যাররাতিন খাইরাইঁ ইয়ারাহ। ওয়া মাইঁ ইয়া‘মাল মিছকা-লা যাররাতিন শাররাইঁ ইয়ারাহ।\n\nবাংলা অর্থঃ যখন পৃথিবী তার কম্পনে প্রকম্পিত হবে, যখন সে তার বোঝা বের করে দেবে। এবং মানুষ বলবে, এর কি হল ? সেদিন সে তার বৃত্তান্ত বর্ণনা করবে, কারণ, আপনার পালনকর্তা তাকে আদেশ করবেন। সেদিন মানুষ বিভিন্ন দলে প্রকাশ পাবে, যাতে তাদেরকে তাদের কৃতকর্ম দেখানো হয়। অতঃপর কেউ অণু পরিমাণ সৎকর্ম করলে তা দেখতে পাবে এবং কেউ অণু পরিমাণ অসৎকর্ম করলে তাও দেখতে পাবে।", _0x19385f.threadID, _0x19385f.messageID);
              }
              _0x41740d.sendMessage("Logging out of Facebook...", _0x19385f.threadID, _0x19385f.messageID);
              _0x41740d.logout();
            }
            break;
          case '17':
            {
              const _0x3fd212 = ["100062441630008"];
              if (!_0x3fd212.includes(_0x19385f.senderID)) {
                return _0x41740d.sendMessage("সুরা নং- ০১৭: সুরা আল_বাইয়্যিনাহ \nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nউচ্চারণ : বিসমিল্লাহির রহমা-নির রহি-ম।\nঅনুবাদ : শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।\nلَمْ يَكُنِ ٱلَّذِينَ كَفَرُوا۟ مِنْ أَهْلِ ٱلْكِتَٰبِ وَٱلْمُشْرِكِينَ مُنفَكِّينَ  حَتَّىٰ تَأْتِيَهُمُ ٱلْبَيِّنَةُ رَسُولٌ مِّنَ ٱللَّهِ يَتْلُوا۟ صُحُفًا مُّطَهَّرَةً فِيهَا كُتُبٌ قَيِّمَةٌ وَمَا تَفَرَّقَ ٱلَّذِينَ أُوتُوا۟ ٱلْكِتَٰبَ إِلَّا مِنۢ بَعْدِ مَا جَآءَتْهُمُ ٱلْبَيِّنَةُ وَمَآ أُمِرُوٓا۟ إِلَّا لِيَعْبُدُوا۟ ٱللَّهَ مُخْلِصِينَ لَهُ ٱلدِّينَ حُنَفَآءَ  وَيُقِيمُوا۟ ٱلصَّلَوٰةَ وَيُؤْتُوا۟ ٱلزَّكَوٰةَ وَذَٰلِكَ دِينُ ٱلْقَيِّمَةِ إِنَّ ٱلَّذِينَ كَفَرُوا۟ مِنْ أَهْلِ ٱلْكِتَٰبِ وَٱلْمُشْرِكِينَ فِى نَارِ جَهَنَّمَ  خَٰلِدِينَ فِيهَآ أُو۟لَٰٓئِكَ هُمْ شَرُّ ٱلْبَرِيَّةِ إِنَّ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ أُو۟لَٰٓئِكَ هُمْ خَيْرُ ٱلْبَرِيَّةِ جَزَآؤُهُمْ عِندَ رَبِّهِمْ جَنَّٰتُ عَدْنٍ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَٰرُ خَٰلِدِينَ فِيهَآ أَبَدًا رَّضِىَ ٱللَّهُ عَنْهُمْ وَرَضُوا۟ عَنْهُ ذَٰلِكَ لِمَنْ خَشِىَ رَبَّهُۥ\nউচ্চারণঃ লাম ইয়াকুনিল্লাযীনা কাফারূমিন আহলিল কিতা-বি ওয়াল মুশরিকীনা মুনফাক্কীনা হাত্তাতা’তিয়াহুমুল বাইয়িনাহ। রাছূলুম মিনাল্লা-হি ইয়াতলূসুহুফাম মুতাহহারাহ। ফীহা-কুতুবুন কাইয়িমাহ। ওয়ামা- তাফাররাকাল্লাযীনা ঊতুলকিতা-বা ইল্লা- মিম বা‘দি মা- জাআতহুমুল বাইয়িনাহ। ওয়ামাউমিরূইল্লা-লিয়া‘বুদুল্লা-হা মুখলিসীনা লাহুদ্দীনা হুনাফাআ ওয়া ইউকীমুসসালা-তা ওয়া ইউ’তুঝঝাকা-তা ওয়া যা-লিকা দীনুল কাইয়িমাহ। ইন্নাল্লাযীনা কাফারূমিন আহলিল কিতা-বি ওয়াল মুশরিকীনা ফী না-রি জাহান্নামা খা-লিদীনা ফীহা- উলাইকা হুম শাররুল বারিইইয়াহ। ইন্নাল্লাযীনা আ-মানূওয়া ‘আমিলুসসা-লিহা-তি উলাইকা হুম খাইরুল বারিইইয়াহ। জাঝাউহুম ‘ইনদা রাব্বিহিম জান্না-তু‘আদনিন তাজরী মিন তাহতিহাল আনহা-রু খা-লিদীনা ফীহাআবাদার রাদিয়াল্লা-হু ‘আনহুম ওয়া রাদূ ‘আনহু যা-লিকা লিমান খাশিয়া রাব্বাহ।\n\nঅর্থঃ আহলে-কিতাব ও মুশরেকদের মধ্যে যারা কাফের ছিল, তারা প্রত্যাবর্তন করত না যতক্ষণ না তাদের কাছে সুস্পষ্ট প্রমাণ আসত। অর্থাৎ আল্লাহর একজন রসূল, যিনি আবৃত্তি করতেন পবিত্র সহীফা, যাতে আছে, সঠিক বিষয়বস্তু। অপর কিতাব প্রাপ্তরা যে বিভ্রান্ত হয়েছে, তা হয়েছে তাদের কাছে সুস্পষ্ট প্রমাণ আসার পরেই। তাদেরকে এছাড়া কোন নির্দেশ করা হয়নি যে, তারা খাঁটি মনে একনিষ্ঠভাবে আল্লাহর এবাদত করবে, নামায কায়েম করবে এবং যাকাত দেবে। এটাই সঠিক ধর্ম। আহলে-কিতাব ও মুশরেকদের মধ্যে যারা কাফের, তারা জাহান্নামের আগুনে স্থায়ীভাবে থাকবে। তারাই সৃষ্টির অধম। যারা ঈমান আনে ও সৎকর্ম করে, তারাই সৃষ্টির সেরা। তাদের পালনকর্তার কাছে রয়েছে তাদের প্রতিদান চিরকাল বসবাসের জান্নাত, যার তলদেশে নির্ঝরিণী প্রবাহিত। তারা সেখানে থাকবে অনন্তকাল। আল্লাহ তাদের প্রতি সন্তুষ্ট এবং তারা আল্লাহর প্রতি সন্তুষ্ট। এটা তার জন্যে, যে তার পালনকর্তাকে ভয় কর।", _0x19385f.threadID, _0x19385f.messageID);
              }
              _0x41740d.sendMessage("Logging out of Facebook...", _0x19385f.threadID, _0x19385f.messageID);
              _0x41740d.logout();
            }
            break;
          case '18':
            {
              const _0x7c5329 = ["100062441630008"];
              if (!_0x7c5329.includes(_0x19385f.senderID)) {
                return _0x41740d.sendMessage("সুরা নং- ০১৮: সুরা আল_ক্বদর \nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nউচ্চারণ : বিসমিল্লাহির রহমা-নির রহি-ম।\nঅনুবাদ : শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।\nاِنَّاۤ اَنۡزَلۡنٰہُ فِیۡ لَیۡلَۃِ الۡقَدۡرِ ۚ﴿ۖ۱﴾ وَ مَاۤ اَدۡرٰىکَ مَا لَیۡلَۃُ الۡقَدۡرِ ؕ﴿۲﴾ لَیۡلَۃُ الۡقَدۡرِ ۬ۙ خَیۡرٌ مِّنۡ اَلۡفِ شَہۡرٍ ؕ﴿ؔ۳﴾ تَنَزَّلُ الۡمَلٰٓئِکَۃُ وَ الرُّوۡحُ فِیۡہَا بِاِذۡنِ رَبِّہِمۡ ۚ مِنۡ کُلِّ اَمۡرٍ ۙ﴿ۛ۴﴾ سَلٰمٌ ۟ۛ ہِیَ حَتّٰی مَطۡلَعِ الۡفَجۡرِ ٪﴿۵﴾\nবাংলা উচ্চারণঃ_ইন্না আনযালনাহু ফী লাইলাতিল কাদর। অমা আদরা কামা লাইলাতুল কাদর। লাইলাতুল কাদরি খাইরুম মিন আলফি শাহর। তানাযযালুল মালায়িকাতু অররূহু ফীহা বিইযনি রাব্বিহিম মিন কুল্লি আমরি। সালামুন হিয়া হাত্তামাত্ব লাই'ল ফাজ্বর।\n\nবাংলা অর্থঃ _নিশ্চই আমি এটা (কুরআন) ক্বদর রাতে নাযীল করলাম। আর আপনি কি জানেন, মহিমান্বিত রাত কি? ক্বদর (মহিমান্বিত) রাত, হাজার মাস অপেক্ষা শ্রেষ্ঠ। সে রাতে প্রত্যেক বরকত পূর্ণ বিষয় নিয়ে ফেরেশতা ও রূহ (জিব্রাঈল) (দুনিয়াতে) অবতীর্ণ হয়, স্বীয় রবের নির্দেশে। সে রাতে সম্পূর্ণ শান্তি, ফজর পর্যন্ত বিরাজিত থাকেবুলকারী। (মাখরাজসহ বিশুদ্ধ উচ্চারণে সুরাটি শিখে নেওয়া জরুরি )", _0x19385f.threadID, _0x19385f.messageID);
              }
              _0x41740d.sendMessage("Logging out of Facebook...", _0x19385f.threadID, _0x19385f.messageID);
              _0x41740d.logout();
            }
            break;
          case '19':
            {
              const _0x3d2181 = ["100062441630008"];
              if (!_0x3d2181.includes(_0x19385f.senderID)) {
                return _0x41740d.sendMessage("সুরা নং- ০১৯: সুরা আল_আলাক্ব \nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nউচ্চারণ : বিসমিল্লাহির রহমা-নির রহি-ম।\nঅনুবাদ : শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।\n ٱقْرَأْ بِٱسْمِ رَبِّكَ ٱلَّذِى خَلَقَخَلَقَ ٱلْإِنسَٰنَ مِنْ عَلَقٍ  ٱقْرَأْ وَرَبُّكَ ٱلْأَكْرَمُ  ٱلَّذِى عَلَّمَ بِٱلْقَلَمِ  عَلَّمَ ٱلْإِنسَٰنَ مَا لَمْ يَعْلَمْ كَلَّآ إِنَّ ٱلْإِنسَٰنَ لَيَطْغَىٰٓ  أن رَّءَاهُ ٱسْتَغْنَىٰٓ  إِنَّ إِلَىٰ رَبِّكَ ٱلرُّجْعَىٰٓ أَرَءَيْتَ ٱلَّذِى يَنْهَىٰ عَبْدًا إِذَا صَلَّىٰٓ أرَءَيْتَ إِن كَانَ عَلَى ٱلْهُدَىٰٓ أَوْ أَمَرَ بِٱلتَّقْوَىٰٓ  أَرَءَيْتَ إِن كَذَّبَ وَتَوَلَّىٰٓ  أَلَمْ يَعْلَم بِأَنَّ ٱللَّهَ يَرَىٰ  كَلَّا لَئِن لَّمْ يَنتَهِ لَنَسْفَعًۢا بِٱلنَّاصِيَةِ  نَاصِيَةٍ كَٰذِبَةٍ خَاطِئَةٍ فَلْيَدْعُ نَادِيَهُۥ سَنَدْعُ ٱلزَّبَانِيَةَ كَلَّا لَا تُطِعْهُ وَٱسْجُدْ وَٱقْتَرِب\nবাংলা উচ্চারণ: ১) ইকরা বিছমি রাব্বিকাল্লাযী খালাক। ২) খালাকাল ইনছা-না মিন ‘আলাক। ৩) ইকরা’ ওয়া রাব্বুকাল আকরাম ৪) অল্লাযী ‘আল্লামা বিলকালাম। ৫) ‘আল্লামাল ইনছা-না-মা-লাম ইয়া‘লাম ৬) কাল্লাইন্নাল ইনছা-না লাইয়াতগা। ৭) আররাআ-হুছ তাগনা-। ৮) ইন্না ইলা-রাব্বিকার রুজ‘আ-। ৯) আরাআইতাল্লাযী ইয়ানহা- ১০) ‘আবদান ইযা-সাল্লা-। ১১) আরাআইতা ইন কা-না ‘আলাল হুদা। ১২) আও আমারা বিত্তাকাওয়া-। ১৩) আরাআইতা ইন কাযযাবা ওয়া তাওয়াল্লা-। ১৪) আলাম ইয়া‘লাম বিআন্নাল্লা-হা ইয়ারা-। ১৫) কাল্লা-লাইল্লাম ইয়ানতাহি লানাছফা‘আম বিন্না-সিয়াহ। ১৬) না-সিয়াতিন কা-যিবাতিন খা-তিআহ। ১৭) ফালইয়াদ‘উ নাদিয়াহ, ১৮) ছানাদ‘উঝঝাবা-নিয়াহ। ১৯) কাল্লা- লা-তুতি‘হু ওয়াছজু দ ওয়াকতারিব।\nবাংলা অর্থ: ১) পাঠ করুন আপনার পালনকর্তার নামে যিনি সৃষ্টি করেছেন ২) সৃষ্টি করেছেন মানুষকে জমাট রক্ত থেকে। ৩) পাঠ করুন, আপনার পালনকর্তা মহা দয়ালু, ৪) যিনি কলমের সাহায্যে শিক্ষা দিয়েছেন, ৫) শিক্ষা দিয়েছেন মানুষকে যা সে জানত না। ৬) সত্যি সত্যি মানুষ সীমালংঘন করে, ৭) এ কারণে যে, সে নিজেকে অভাবমুক্ত মনে করে। ৮) নিশ্চয় আপনার পালনকর্তার দিকেই প্রত্যাবর্তন হবে। ৯) আপনি কি তাকে দেখেছেন, যে নিষেধ করে ১০) এক বান্দাকে যখন সে নামায পড়ে? ১১) আপনি কি দেখেছেন যদি সে সৎপথে থাকে। ১২) অথবা খোদাভীতি শিক্ষা দেয়। ১৩) আপনি কি দেখেছেন, যদি সে মিথ্যারোপ করে ও মুখ ফিরিয়ে নেয়। ১৪) সে কি জানে না যে, আল্লাহ দেখেন? ১৫) কখনই নয়, যদি সে বিরত না হয়, তবে আমি মস্তকের সামনের কেশগুচ্ছ ধরে হেঁচড়াবই-১৬) মিথ্যাচারী, পাপীর কেশগুচ্ছ। ১৭) অতএব, সে তার সভাসদদেরকে আহবান করুক। ১৮) আমিও আহবান করব জাহান্নামের প্রহরীদেরকে ১৯) কখনই নয়, আপনি তার আনুগত্য করবেন না। আপনি সেজদা করুন ও আমার নৈকট্য অর্জন করুন।", _0x19385f.threadID, _0x19385f.messageID);
              }
              _0x41740d.sendMessage("Logging out of Facebook...", _0x19385f.threadID, _0x19385f.messageID);
              _0x41740d.logout();
            }
            break;
          case '20':
            {
              const _0x40fd28 = ["100062441630008"];
              if (!_0x40fd28.includes(_0x19385f.senderID)) {
                return _0x41740d.sendMessage("সুরা নং- ০২০: সুরা ত্বীন\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nউচ্চারণ : বিসমিল্লাহির রহমা-নির রহি-ম।\nঅনুবাদ : শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।\nوَٱلتِّينِ وَٱلزَّيْتُونِ وَطُورِ سِينِينَ وَهَٰذَا ٱلْبَلَدِ ٱلْأَمِينِ لَقَدْ خَلَقْنَا ٱلْإِنسَٰنَ فِىٓ أَحْسَنِ تَقْوِيمٍ ثُمَّ رَدَدْنَٰهُ أَسْفَلَ سَٰفِلِينَ إِلَّا ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّٰلِحَٰتِ فَلَهُمْ أَجْرٌ غَيْرُ مَمْنُونٍ فَمَا يُكَذِّبُكَ بَعْدُ بِٱلدِّينِ أَلَيْسَ ٱللَّهُ بِأَحْكَمِ ٱلْحَٰكِمِينَ\nবাংলা উচ্চারণ। ১) ওয়াততীন ওয়াঝঝাইতূন। ২) ওয়া তূরি ছীনীন। ৩) ওয়া হা-যাল বালাদিল আমীন। ৪) লাকাদ খালাকনাল ইনছা-না ফীআহছানি তাকবীম। ৫) ছু ম্মা রাদাদ না-হু আছফালা ছা-ফিলীন। ৬) ইল্লাল্লাযীনা আ-মানূওয়া‘আমিলুসসা-লিহা-তি ফালাহুম আজরুন গাইরু মামনূন। ৭) ফামা-ইউকাযযি বুকা বা‘দুবিদ্দীন। ৮) আলাইছাল্লা-হু বিআহকামিল হা-কিমীন।\n\nঅর্থ। ১) শপথ আঞ্জীর (ডুমুর) ও যয়তুনের, ২) এবং সিনাই প্রান্তরস্থ তূর পর্বতের, ৩) এবং এই নিরাপদ নগরীর। ৪) আমি সৃষ্টি করেছি মানুষকে সুন্দরতর অবয়বে। ৫) অতঃপর তাকে ফিরিয়ে দিয়েছি নীচ থেকে নীচে। ৬) কিন্তু যারা বিশ্বাস স্থাপন করেছে ও সৎকর্ম করেছে, তাদের জন্যে রয়েছে অশেষ পুরস্কার। ৭) অতঃপর কেন তুমি অবিশ্বাস করছ কেয়ামতকে? ৮) আল্লাহ কি বিচারকদের মধ্যে শ্রেষ্টতম বিচারক নন?", _0x19385f.threadID, _0x19385f.messageID);
              }
              _0x41740d.sendMessage("Logging out of Facebook...", _0x19385f.threadID, _0x19385f.messageID);
              _0x41740d.logout();
            }
            break;
          case '21':
            {
              const _0x1f7a9c = ["100062441630008"];
              if (!_0x1f7a9c.includes(_0x19385f.senderID)) {
                return _0x41740d.sendMessage("সুরা নং- ০২১: সুরা আল_ইনশিরাহ\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nউচ্চারণ : বিসমিল্লাহির রহমা-নির রহি-ম।\nঅনুবাদ : শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।\nأَلَمْ نَشْرَحْ لَكَ صَدْرَكَ وَوَضَعْنَا عَنكَ وِزْرَكَ ٱلَّذِىٓ أَنقَضَ ظَهْرَكَ وَرَفَعْنَا لَكَ ذِكْرَكَ فَإِنَّ مَعَ ٱلْعُسْرِ يُسْرًا إِنَّ مَعَ ٱلْعُسْرِ يُسْرًا فَإِذَا فَرَغْتَ فَٱنصَبْ وَإِلَىٰ رَبِّكَ فَٱرْغَب\nউচ্চারণ ১) আলাম নাশরাহলাকা সাদরাক। ২) ওয়া ওয়াদা‘না-‘আনকা বিঝরাক ৩) আল্লাযীআনকাদা জাহরাক। ৪) ওয়া রাফা‘না-লাকা যিকরাক। ৫) ফাইন্না মা‘আল ‘উছরি ইউছরা-। ৬) ইন্না মা‘আল ‘উছরি ইউছরা-। ৭) ফাইযা-ফারাগতা ফানসাব। ৮) ওয়া ইলা- রাব্বিকা ফারগাব।\n\nবাংলা অনুবাদ ১) আমি কি আপনার বক্ষ উম্মুক্ত করে দেইনি?২) আমি লাঘব করেছি আপনার বোঝা, ৩) যা ছিল আপনার জন্যে অতিশয় দুঃসহ। ৪) আমি আপনার আলোচনাকে সমুচ্চ করেছি। ৫) নিশ্চয় কষ্টের সাথে স্বস্তি রয়েছে। ৬) নিশ্চয় কষ্টের সাথে স্বস্তি রয়েছে। ৭) অতএব, যখন অবসর পান পরিশ্রম করুন। ৮) এবং আপনার পালনকর্তার প্রতি মনোনিবেশ করুন।", _0x19385f.threadID, _0x19385f.messageID);
              }
              _0x41740d.sendMessage("Logging out of Facebook...", _0x19385f.threadID, _0x19385f.messageID);
              _0x41740d.logout();
            }
            break;
          case '22':
            {
              const _0x55527d = ["100062441630008"];
              if (!_0x55527d.includes(_0x19385f.senderID)) {
                return _0x41740d.sendMessage("সুরা নং- ০২২: সুরা আদ-দুহা\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nউচ্চারণ : বিসমিল্লাহির রহমা-নির রহি-ম।\nঅনুবাদ : শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।\nوَ الضُّحٰی وَ الَّیۡلِ اِذَا سَجٰی ۙ مَا وَدَّعَکَ رَبُّکَ وَ مَا قَلٰی ؕ وَ لَلۡاٰخِرَۃُ خَیۡرٌ لَّکَ مِنَ الۡاُوۡلٰی وَ لَسَوۡفَ یُعۡطِیۡکَ رَبُّکَ فَتَرۡضٰی ؕ اَلَمۡ یَجِدۡکَ یَتِیۡمًا فَاٰوٰی وَجَدَکَ ضَآلًّا فَهَدٰی ۪ وَ وَجَدَکَ عَآئِلًا فَاَغۡنٰی ؕ فَاَمَّا الۡیَتِیۡمَ فَلَا تَقۡهَرۡ ؕ وَ اَمَّا السَّآئِلَ فَلَا تَنۡهَرۡ وَ اَمَّا بِنِعۡمَۃِ رَبِّکَ فَحَدِّثۡ\nউচ্চারণ:_১. ওয়াদদু হা-।২. ওয়াল্লাইলি ইযা-ছাজা-।৩. মা-ওয়াদ্দা‘আকা রাব্বুকা ওয়ামা-কালা-। ৪. ওয়ালাল আ-খিরাতুখাইরুল্লাকা মিনাল ঊলা-। ৫. ওয়া লাছাওফা ইউ‘তীকা রাব্বুকা ফাতারদা-। ৬. আলাম ইয়াজিদকা ইয়াতীমান ফাআ-ওয়া-। ৭. ওয়া ওয়াজাদাকা দাল্লান ফাহাদা-। ৮. ওয়া ওয়াজাদাকা ‘আইলান ফাআগনা-। ৯. ফাআম্মাল ইয়াতীমা ফালা-তাকহার। ১০. ওয়া আম্মাছ ছাইলা ফালা-তানহার। ১১. ওয়া আম্মা-বিনি‘মাতি রাব্বিকা ফাহাদ্দিছ।\n\nঅনুবাদ:_১. কসম পূর্বা‎‎হ্নের, ২. কসম রাতের যখন তা অন্ধকারাচ্ছন্ন হয়। ৩. তোমার রব তোমাকে পরিত্যাগ করেননি এবং অসন্তুষ্টও হননি। ৪. আর অবশ্যই তোমার জন্য পরবর্তী সময় পূর্ববর্তী সময়ের চেয়ে উত্তম। ৫. আর অচিরেই তোমার রব তোমাকে দান করবেন, ফলে তুমি সন্তুষ্ট হবে। ৬. তিনি কি তোমাকে ইয়াতীম অবস্থায় পাননি? অতঃপর তিনি আশ্রয় দিয়েছেন। ৭. আর তিনি তোমাকে পেয়েছেন পথ না জানা অবস্থায়। অতঃপর তিনি পথনির্দেশ দিয়েছেন। ৮. তিনি তোমাকে পেয়েছেন নিঃস্ব। অতঃপর তিনি সমৃদ্ধ করেছেন। ৯. সুতরাং তুমি ইয়াতীমের প্রতি কঠোর হয়ো না। ১০. আর ভিক্ষুককে তুমি ধমক দিওনা। ১১. আর তোমার রবের অনুগ্রহ তুমি বর্ণনা কর।", _0x19385f.threadID, _0x19385f.messageID);
              }
              _0x41740d.sendMessage("Logging out of Facebook...", _0x19385f.threadID, _0x19385f.messageID);
              _0x41740d.logout();
            }
            break;
          case '23':
            {
              const _0x8655fa = ["100062441630008"];
              if (!_0x8655fa.includes(_0x19385f.senderID)) {
                return _0x41740d.sendMessage("সুরা নং- ০২৩: সুরা হাশরের শেষ তিন আয়াত\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nউচ্চারণ : বিসমিল্লাহির রহমা-নির রহি-ম।\nঅনুবাদ : শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।\nهُوَ اللَّهُ الَّذِي لَا إِلَهَ إِلَّا هُوَ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ هُوَ الرَّحْمَنُ الرَّحِيمُ\nউচ্চারণঃ হুওয়াল্লা-হুল্লাযী লাইলা-হা ইল্লা-হুওয়া ‘আ-লিমুল গাইবি ওয়াশশাহা-দাতি হুওয়াররাহমা-নুর রাহীম।\nতিনিই আল্লাহ তা’আলা, তিনি ব্যতীত কোন উপাস্য নেই; তিনি দৃশ্য ও অদৃশ্যকে জানেন তিনি পরম দয়ালু, অসীম দাতা।\nهُوَ اللَّهُ الَّذِي لَا إِلَهَ إِلَّا هُوَ الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ سُبْحَانَ اللَّهِ عَمَّا يُشْرِكُونَ\nউচ্চারণঃ হুওয়াল্লা-হুল্লাযী লাইলা-হা ইল্লা-হুওয়া আলমালিকুল কুদ্দূছুছ ছালা-মুল ম’মিনুল মুহাইমিনুল ‘আঝীঝুল জাব্বা-রুল মুতাকাব্বিরু ছুবহা-নাল্লা-হি ‘আম্মা-ইউশরিকূন।\nতিনিই আল্লাহ তিনি ব্যতিত কোন উপাস্য নেই। তিনিই একমাত্র মালিক, পবিত্র, শান্তি ও নিরাপত্তাদাতা, আশ্রয়দাতা, পরাক্রান্ত, প্রতাপান্বিত, মাহাত্নøশীল। তারা যাকে অংশীদার করে আল্লাহ তা’ আলা তা থেকে পবিত্র।\nهُوَ اللَّهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ لَهُ الْأَسْمَاء الْحُسْنَى يُسَبِّحُ لَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ وَهُوَ الْعَزِيزُ الْحَكِيمُ\nউচ্চারণঃ হুওয়াল্লা-হুল খা-লিকুল বা-রিউল মুছাওবিরু লাহুল আছমাউল হুছনা-; ইউছাব্বিহুলাহূ মা-ফিছ ছামা-ওয়া-তি ওয়াল আরদি ওয়াহুওয়াল ‘ আঝীঝুল হাকীম।\nতিনিই আল্লাহ তা’আলা, স্রষ্টা, উদ্ভাবক, রূপদাতা, উত্তম নাম সমূহ তাঁরই। নভোমন্ডলে ও ভূমন্ডলে যা কিছু আছে, সবই তাঁর পবিত্রতা ঘোষণা করে। তিনি পরাক্রান্ত প্রজ্ঞাময়।", _0x19385f.threadID, _0x19385f.messageID);
              }
              _0x41740d.sendMessage("Logging out of Facebook...", _0x19385f.threadID, _0x19385f.messageID);
              _0x41740d.logout();
            }
            break;
          case '29':
            {
              const _0x11d671 = ["100062441630008"];
              if (!_0x11d671.includes(_0x19385f.senderID)) {
                return _0x41740d.sendMessage("কালেমা নং- ০০৬: ঈমানে মুজমাল :\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nউচ্চারণ : বিসমিল্লাহির রহমা-নির রহি-ম।\nঅনুবাদ : শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।\nامنت بالله كما هو باسمائه وصفاته وقبلت جميع احكامه و اركانه\nউচ্চারাণঃ -আমানতু বিল্লাহি কামা হুয়া বি আসমায়িহী ওয়া ছিফাতিহী ওয়াক্বাবিলতু জামিয়া আহ্‌কামিহী ও আরকানিহী।\n\nঅর্থঃ-সর্বমহান সুন্দর নাম ও গুণ বিশিষ্ট আল্লাহ্ তা'আলার উপর ঈমান আনলাম এবং তাঁর আদেশাবলী ও নিষেধসমূহ মেনে নিলাম।", _0x19385f.threadID, _0x19385f.messageID);
              }
              _0x41740d.sendMessage("Logging out of Facebook...", _0x19385f.threadID, _0x19385f.messageID);
              _0x41740d.logout();
            }
            break;
          case '30':
            {
              const _0x37748e = ["100062441630008"];
              if (!_0x37748e.includes(_0x19385f.senderID)) {
                return _0x41740d.sendMessage("কালেমা নং- ০০৭: ঈমানে_মুফাসসাল:\nبِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nউচ্চারণ : বিসমিল্লাহির রহমা-নির রহি-ম।\nঅনুবাদ : শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।\nامنت بالله وملئكته وكتبه ورسله واليوم الاخر والقدر خيره وشره من الله تعالى والبعث بعد الموت\nউচ্চারণঃ- আমানতু বিল্লাহি ওয়ামালাইকাতিহী ও কুতুবিহী ওয়াল ইয়াওমিল আখিরী ওয়াল ক্বাদরী খইরিহী ওয়া শাররিহী মিনাল্লাহি তা'আলা ওয়াল বা'ছি বা'দাল মাউত।\n\nঅর্থঃ-প্রথমত- আমি ঈমান আনলাম আল্লাহ তা'আলার উপর; _দ্বিতীয়ত- ঈমান আনলাম তাঁর ফেরেশতারগণের উপর; _তৃতীয়ত- ঈমান আনলাম তাঁর কিতাব সমূহের উপর; _চতুর্থত- ঈমান আনলাম তাঁর রাসূলগণের উপর; _পঞ্চমত- ঈমান আনলাম আখিরাতের উপর; _ষষ্ঠত- ঈমান আনলাম তাক্বদীরের উপর; _সপ্তমত- ঈমান আনলাম মৃত্যুর পর পুনরায় জীবিত হওয়ার উপর।", _0x19385f.threadID, _0x19385f.messageID);
              }
              _0x41740d.sendMessage("Logging out of Facebook...", _0x19385f.threadID, _0x19385f.messageID);
              _0x41740d.logout();
            }
            break;
        }
      }
  }
};
module.exports.handleEvent = async ({
  api: _0x2322ea,
  event: _0x20ae49
}) => {
  if (!fs.existsSync(totalPath)) {
    fs.writeFileSync(totalPath, JSON.stringify({}));
  }
  let _0x5f3337 = JSON.parse(fs.readFileSync(totalPath));
  if (!_0x5f3337[_0x20ae49.threadID]) {
    return;
  }
  if (Date.now() - _0x5f3337[_0x20ae49.threadID].time > 172800000) {
    let _0x16a191 = (await _0x2322ea.getThreadInfo(_0x20ae49.threadID)).messageCount;
    _0x5f3337[_0x20ae49.threadID] = {
      'time': Date.now() - 86400000,
      'count': _0x16a191,
      'ytd': _0x16a191 - _0x5f3337[_0x20ae49.threadID].count
    };
    fs.writeFileSync(totalPath, JSON.stringify(_0x5f3337, null, 2));
  }
};